swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.c
/***************************************************************************//**
* \file CapSense_1_Structure.c
* \version 3.0
*
* \brief
*   This file defines the data structure global variables and provides implementation
*   for the high-level and low-level APIs of the Data Structure module.
*
* \see CapSense_1 v3.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#include "syslib/cy_syslib.h"
#include <stddef.h>
#include <string.h>
#include "cyfitter_gpio.h"

#include "CapSense_1_Structure.h"
#include "CapSense_1_Configuration.h"

#if (0u != CapSense_1_ADC_EN)
    #include "CapSense_1_Adc.h"
#endif /* (0u != CapSense_1_ADC_EN) */

#if (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN)
    #include "CapSense_1_SelfTest.h"
#endif

#if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
    #include "CapSense_1_AdvancedCentroid_LL.h"
#endif

#if (CapSense_1_ENABLE == CapSense_1_GES_GLOBAL_EN)
    #include "CapSense_1_Gesture.h"
#endif /* (CapSense_1_ENABLE == CapSense_1_GES_GLOBAL_EN) */

/*******************************************************************************
* Defines the RAM Data Structure variables and their init data in flash
*******************************************************************************/
/**
* \cond SECTION_GLOBAL_VARIABLES
* \addtogroup group_global_variables
* \{
*/

/**
* The variable that contains the CapSense_1 configuration, settings and
* scanning results. CapSense_1_dsRam represents RAM Data Structure.
*/
CapSense_1_RAM_STRUCT CapSense_1_dsRam;
/** \}
* \endcond */

/*******************************************************************************
* Declares Widget's De-bounce Counters
*******************************************************************************/
static uint8 CapSense_1_debounceLinearSlider0[1u];
static uint8 CapSense_1_debounceButton0[CapSense_1_BUTTON0_NUM_SENSORS];
static uint8 CapSense_1_debounceButton1[CapSense_1_BUTTON1_NUM_SENSORS];


/***************************************************************************//**
* Declares Noise Envelope data structures
*******************************************************************************/
static SMARTSENSE_CSD_NOISE_ENVELOPE_STRUCT CapSense_1_noiseEnvlpLinearSlider0[CapSense_1_LINEARSLIDER0_NUM_SENSORS];

/*******************************************************************************
* Defines and initializes the Flash Data Structure
*******************************************************************************/



/**
* \cond SECTION_API_CONSTANTS
* \addtogroup group_api_constants
* \{
*/
/**
* Constant for the FLASH Data Structure
*/
const CapSense_1_FLASH_STRUCT CapSense_1_dsFlash =
{
    /* Flash Widget Initialization Data */
    {
        { /* LinearSlider0 */
            &CapSense_1_ioList[0u],
            (void *)&CapSense_1_dsRam.wdgtList.linearslider0,
            CapSense_1_dsRam.snsList.linearslider0,
            (void *)0u,
            CapSense_1_debounceLinearSlider0,
            CapSense_1_LINEARSLIDER0_STATIC_CONFIG,
            CapSense_1_LINEARSLIDER0_NUM_SENSORS,
            (uint8)CapSense_1_WD_LINEAR_SLIDER_E,
            (uint8)CapSense_1_SENSE_METHOD_CSD_E,
            CapSense_1_LINEARSLIDER0_NUM_SENSORS,
            0u,
            CapSense_1_LINEARSLIDER0_X_RESOLUTION,
            CapSense_1_LINEARSLIDER0_X_CENT_MULT,
            CapSense_1_noiseEnvlpLinearSlider0,
            CapSense_1_LINEARSLIDER0_IIR_FILTER_COEFF,
        },
        { /* Button0 */
            &CapSense_1_ioList[5u],
            (void *)&CapSense_1_dsRam.wdgtList.button0,
            CapSense_1_dsRam.snsList.button0,
            (void *)0u,
            CapSense_1_debounceButton0,
            CapSense_1_BUTTON0_STATIC_CONFIG,
            CapSense_1_BUTTON0_NUM_SENSORS,
            (uint8)CapSense_1_WD_BUTTON_E,
            (uint8)CapSense_1_SENSE_METHOD_CSX_E,
            CapSense_1_BUTTON0_NUM_SENSORS,
            1u,
            0u,
            0u,
            (SMARTSENSE_CSD_NOISE_ENVELOPE_STRUCT *)0u,
            0u,
        },
        { /* Button1 */
            &CapSense_1_ioList[7u],
            (void *)&CapSense_1_dsRam.wdgtList.button1,
            CapSense_1_dsRam.snsList.button1,
            (void *)0u,
            CapSense_1_debounceButton1,
            CapSense_1_BUTTON1_STATIC_CONFIG,
            CapSense_1_BUTTON1_NUM_SENSORS,
            (uint8)CapSense_1_WD_BUTTON_E,
            (uint8)CapSense_1_SENSE_METHOD_CSX_E,
            CapSense_1_BUTTON1_NUM_SENSORS,
            1u,
            0u,
            0u,
            (SMARTSENSE_CSD_NOISE_ENVELOPE_STRUCT *)0u,
            0u,
        },
    },
};

/**
* The array of the pointers to the electrode specific register.
*/
const CapSense_1_FLASH_IO_STRUCT CapSense_1_ioList[CapSense_1_TOTAL_ELECTRODES] =
{
    { /* 0: LinearSlider0_Sns0 */
        CapSense_1_Sns_0_PORT,
        (uint8)CapSense_1_Sns_0_NUM,
    },
    { /* 1: LinearSlider0_Sns1 */
        CapSense_1_Sns_1_PORT,
        (uint8)CapSense_1_Sns_1_NUM,
    },
    { /* 2: LinearSlider0_Sns2 */
        CapSense_1_Sns_2_PORT,
        (uint8)CapSense_1_Sns_2_NUM,
    },
    { /* 3: LinearSlider0_Sns3 */
        CapSense_1_Sns_3_PORT,
        (uint8)CapSense_1_Sns_3_NUM,
    },
    { /* 4: LinearSlider0_Sns4 */
        CapSense_1_Sns_4_PORT,
        (uint8)CapSense_1_Sns_4_NUM,
    },
    { /* 5: Button0_Rx0 */
        CapSense_1_Rx_0_PORT,
        (uint8)CapSense_1_Rx_0_NUM,
    },
    { /* 6: Button0_Tx */
        CapSense_1_Tx_0_PORT,
        (uint8)CapSense_1_Tx_0_NUM,
    },
    { /* 7: Button1_Rx0 */
        CapSense_1_Rx_1_PORT,
        (uint8)CapSense_1_Rx_1_NUM,
    },
    { /* 8: Button0_Tx ganged to Button1_Tx */
        CapSense_1_Tx_0_PORT,
        (uint8)CapSense_1_Tx_0_NUM,
    },
};



/** \}
* \endcond */

