swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.c
/* Initialization data for RAM widget list */
const CapSense_1_RAM_WD_LIST_STRUCT CapSense_1_ramWidgetInit =
{
    { /* LinearSlider0 */
        CapSense_1_LINEARSLIDER0_RESOLUTION,
        CapSense_1_LINEARSLIDER0_FINGER_TH,
        CapSense_1_LINEARSLIDER0_NOISE_TH,
        CapSense_1_LINEARSLIDER0_NNOISE_TH,
        CapSense_1_LINEARSLIDER0_HYSTERESIS,
        CapSense_1_LINEARSLIDER0_ON_DEBOUNCE,
        CapSense_1_LINEARSLIDER0_LOW_BSLN_RST,
        {
            CapSense_1_LINEARSLIDER0_IDAC_MOD0,
        },
        CapSense_1_LINEARSLIDER0_SNS_CLK,
        CapSense_1_LINEARSLIDER0_SNS_CLK_SOURCE,
        CapSense_1_LINEARSLIDER0_FINGER_CAP,
        CapSense_1_LINEARSLIDER0_SIGPFC,
        {
            CapSense_1_LINEARSLIDER0_POSITION,
        },
    },
    { /* Button0 */
        CapSense_1_BUTTON0_RESOLUTION,
        CapSense_1_BUTTON0_FINGER_TH,
        CapSense_1_BUTTON0_NOISE_TH,
        CapSense_1_BUTTON0_NNOISE_TH,
        CapSense_1_BUTTON0_HYSTERESIS,
        CapSense_1_BUTTON0_ON_DEBOUNCE,
        CapSense_1_BUTTON0_LOW_BSLN_RST,
        {
            CapSense_1_BUTTON0_IDAC_MOD0,
        },
        CapSense_1_BUTTON0_SNS_CLK,
        CapSense_1_BUTTON0_SNS_CLK_SOURCE,
        CapSense_1_BUTTON0_FINGER_CAP,
        CapSense_1_BUTTON0_SIGPFC,
    },
    { /* Button1 */
        CapSense_1_BUTTON1_RESOLUTION,
        CapSense_1_BUTTON1_FINGER_TH,
        CapSense_1_BUTTON1_NOISE_TH,
        CapSense_1_BUTTON1_NNOISE_TH,
        CapSense_1_BUTTON1_HYSTERESIS,
        CapSense_1_BUTTON1_ON_DEBOUNCE,
        CapSense_1_BUTTON1_LOW_BSLN_RST,
        {
            CapSense_1_BUTTON1_IDAC_MOD0,
        },
        CapSense_1_BUTTON1_SNS_CLK,
        CapSense_1_BUTTON1_SNS_CLK_SOURCE,
        CapSense_1_BUTTON1_FINGER_CAP,
        CapSense_1_BUTTON1_SIGPFC,
    },
};


/* IDAC Initialization Data */
const uint8 CapSense_1_ramIdacInit[CapSense_1_TOTAL_SENSORS] =
{
    /* LinearSlider0 */
    CapSense_1_LINEARSLIDER0_SNS0_IDAC_COMP0,
    CapSense_1_LINEARSLIDER0_SNS1_IDAC_COMP0,
    CapSense_1_LINEARSLIDER0_SNS2_IDAC_COMP0,
    CapSense_1_LINEARSLIDER0_SNS3_IDAC_COMP0,
    CapSense_1_LINEARSLIDER0_SNS4_IDAC_COMP0,

    /* Button0 */
    CapSense_1_BUTTON0_RX0_IDAC_COMP0,

    /* Button1 */
    CapSense_1_BUTTON1_RX0_IDAC_COMP0,
};



/*******************************************************************************
* Defines internal data types and statements
*******************************************************************************/
#define PARAM_TYPE_OFFSET       (30u)
#define PARAM_TYPE_MASK         (3Lu << PARAM_TYPE_OFFSET)
#define PARAM_RWBIT_OFFSET      (29u)
#define PARAM_RWBIT_MASK        (1Lu << PARAM_RWBIT_OFFSET)
#define PARAM_FBIT_OFFSET       (28u)
#define PARAM_FBIT_MASK         (1Lu << PARAM_FBIT_OFFSET)
#define PARAM_UBIT_OFFSET       (23u)
#define PARAM_UBIT_MASK         (1Lu << PARAM_UBIT_OFFSET)
#define PARAM_WDID_OFFSET       (16u)
#define PARAM_WDID_MASK         (0x7FLu << PARAM_WDID_OFFSET)
#define PARAM_CRC_OFFSET        (24u)
#define PARAM_CRC_MASK          (0x0FLu << PARAM_CRC_OFFSET)

/* Defines align masks for uint16 and uint32 */
#define UINT16_ALIGN_MASK       (1Lu)
#define UINT32_ALIGN_MASK       (3Lu)

/* Defines supported parameter types */
#define DS_PARAM_TYPE_UINT8     (0x01u)
#define DS_PARAM_TYPE_UINT16    (0x02u)
#define DS_PARAM_TYPE_UINT32    (0x03u)


/* Defines PARAM_ID structure */
typedef struct
{
    uint16 offset;      /* parameter offset */
    uint8  widgetId;    /* widget Id parameter belongs to */
    uint8  affectsCrc;  /* parameter affects widget CRC */
    uint8  crc;         /* parameter CRC */
    uint8  flash;       /* parameter located in FLASH flag */
    uint8  rw;          /* parameter is read/write flag */
    uint8  type;        /* parameter type: uint8/uint16/uint32 */
} PARAM_ID_STRUCT;


/*******************************************************************************
* Static Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/



static cy_status DsParseParamId(uint32 paramId, PARAM_ID_STRUCT *pData);

/** \}
* \endcond */


/*******************************************************************************
* Function Name: CapSense_1_DsInitialize
****************************************************************************//**
*
* \brief
*   This function initializes the Data Structure storage.
*
* \details
*   This function copies the default widget configuration parameters
*   from the Flash storage into the RAM Data Structure.
*
*******************************************************************************/
void CapSense_1_DsInitialize(void)
{
    #if ((CapSense_1_ENABLE == CapSense_1_CSX_EN) || \
         (CapSense_1_ENABLE == CapSense_1_CSD_IDAC_COMP_EN) || \
        ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
         (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)))
        uint32 snsId;
        uint32 wdgtId;
        CapSense_1_RAM_SNS_STRUCT * ptrSnsTmp;
        CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt;
    #endif

    #if ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
         (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES))
        uint16 subConvNumber;
    #endif

    #if (0u != CapSense_1_CSX_EN) || (0 != CapSense_1_CSD_IDAC_COMP_EN)
        uint8 const * ptrIdacInit = CapSense_1_ramIdacInit;
    #endif

    /* Reset RAM data structure content */
    (void)memset(&CapSense_1_dsRam, 0, sizeof(CapSense_1_dsRam));

    /* Initialize configId, deviceId and hwClock registers */
    CapSense_1_dsRam.configId = CapSense_1_CONFIG_ID;
    CapSense_1_dsRam.deviceId = CapSense_1_DEVICE_ID;
    CapSense_1_dsRam.hwClock = CapSense_1_HW_CLOCK;

    /* Initialize global RAM data */
    CapSense_1_dsRam.csd0Config = CapSense_1_CSD0_CONFIG;

    #if (0u != CapSense_1_TOTAL_CSD_WIDGETS)
        CapSense_1_dsRam.modCsdClk = CapSense_1_CSD_SCANSPEED_DIVIDER;

        #if (0u != CapSense_1_CSD_COMMON_SNS_CLK_EN)
            CapSense_1_dsRam.snsCsdClk = CapSense_1_CSD_SNS_CLK_DIVIDER;
        #endif /* #if (0u != CapSense_1_CSD_COMMON_SNS_CLK_EN) */
    #endif /* #if (0u != CapSense_1_TOTAL_CSD_WIDGETS) */

