swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.c
    #if (0u != CapSense_1_CSX_EN)
        CapSense_1_dsRam.modCsxClk = CapSense_1_CSX_SCANSPEED_DIVIDER;

        #if (0u != CapSense_1_CSX_COMMON_TX_CLK_EN)
            CapSense_1_dsRam.snsCsxClk = CapSense_1_CSX_TX_CLK_DIVIDER;
        #endif /* #if (0u != CapSense_1_CSX_COMMON_TX_CLK_EN) */
    #endif /* #if (0u != CapSense_1_CSX_EN) */

    #if (0u != CapSense_1_SELF_TEST_EN)
        CapSense_1_dsRam.glbCrc = CapSense_1_GLB_CRC;
    #endif /* #if (0u != CapSense_1_SELF_TEST_EN) */

    /* Initialize RAM widget data */
    CapSense_1_dsRam.wdgtList = CapSense_1_ramWidgetInit;

    /* Initialize Gesture configuration structure */
    #if ((0u != CapSense_1_GES_GLOBAL_EN) || (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN))
        CapSense_1_dsRam.timestampInterval = CapSense_1_TIMESTAMP_INTERVAL;
    #endif /* ((0u != CapSense_1_GES_GLOBAL_EN) || (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN)) */

    #if (0u != CapSense_1_GES_GLOBAL_EN)
        CapSense_1_dsRam.gestures = CapSense_1_ramGesturesInit;
    #endif /* (0u != CapSense_1_GES_GLOBAL_EN) */

    #if (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN)
        CapSense_1_dsRam.ballisticConfig = CapSense_1_ramBallisticInit;
    #endif /* (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN) */

    #if (0u != CapSense_1_CSX_EN) || (0 != CapSense_1_CSD_IDAC_COMP_EN)
        /* Initialize IDAC data */
        ptrFlashWdgt = CapSense_1_dsFlash.wdgtArray;

        for (wdgtId = CapSense_1_TOTAL_WIDGETS; wdgtId-- > 0u; )
        {
            ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;

            for (snsId = CapSense_1_GET_SNS_CNT_BY_PTR(ptrFlashWdgt); snsId-- > 0u;)
            {
                ptrSnsTmp->idacComp[0u] = *ptrIdacInit;
                ptrIdacInit++;

                #if (0u != CapSense_1_MULTI_FREQ_SCAN_EN)
                    ptrSnsTmp->idacComp[1u] = *ptrIdacInit;
                    ptrIdacInit++;

                    ptrSnsTmp->idacComp[2u] = *ptrIdacInit;
                    ptrIdacInit++;
                #endif /* #if (0u != CapSense_1_MULTI_FREQ_SCAN_EN) */

                ptrSnsTmp++;
            }

            ptrFlashWdgt++; /* Move to next widget */
        }
    #endif /*(0u != CapSense_1_CSX_EN) || (0 != CapSense_1_CSD_IDAC_COMP_EN)*/

    #if ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
         (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES))
        /* Initialize Sub-Conversion Number for each node of each CSX widget */
        ptrFlashWdgt = CapSense_1_dsFlash.wdgtArray;
        for (wdgtId = CapSense_1_TOTAL_WIDGETS; wdgtId-- > 0u;)
        {
            /* Check for widget sense method */
            if (CapSense_1_SENSE_METHOD_CSX_E == CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
            {
                /* Take the sub-convesion number of a CSX widget and initialize each node of this widget */
                subConvNumber = ((CapSense_1_RAM_WD_BASE_STRUCT *)(ptrFlashWdgt->ptr2WdgtRam))->resolution;
                ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
                for (snsId = CapSense_1_GET_SNS_CNT_BY_PTR(ptrFlashWdgt); snsId-- > 0u;)
                {
                    ptrSnsTmp->subConvNum = subConvNumber;
                    ptrSnsTmp++;
                }
            }
            /* Move to the next widget */
            ptrFlashWdgt++;
        }
    #endif /* ((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
               (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)) */

    #if (0u != CapSense_1_ADC_EN)
        CapSense_1_AdcDsInitialize();
    #endif /* (0u != CapSense_1_ADC_EN) */
}


#if (0u != CapSense_1_ADC_EN)
    /*******************************************************************************
    * Function Name: CapSense_1_AdcDsInitialize
    ****************************************************************************//**
    *
    * \brief
    *   Configures the initial Adc datastructure members.
    *
    *******************************************************************************/
    void CapSense_1_AdcDsInitialize(void)
    {
        CapSense_1_dsRam.adcResolution = CapSense_1_ADC_RESOLUTION;
        CapSense_1_dsRam.adcIdac = (uint8)(CapSense_1_ADC_IDAC_DEFAULT);
        CapSense_1_dsRam.adcActiveCh = CapSense_1_AdcNO_CHANNEL;
    }
#endif /* (0u != CapSense_1_ADC_EN) */


/*******************************************************************************
* Function Name: DsParseParamId
****************************************************************************//**
*
* \brief
*   This function parses the parameter ID and checks its correctness.
*
* \details
*   This function checks the parameter CRC if the self-test is enabled,
*   validates the offset value and parameter type.
*
* \param paramId The parameter to parse.
* \param pData   The pointer to the structure that will hold parsed data.
*
* \return CY_RET_SUCCESS     If the parameter is valid
*         CY_RET_BAD_PARAM   If  the parameter is invalid
*
*******************************************************************************/
static cy_status DsParseParamId(uint32 paramId, PARAM_ID_STRUCT *pData)
{
    cy_status result = CY_RET_SUCCESS;

    #if (0u != CapSense_1_SELF_TEST_EN)
        const uint8 crcTable[] =
        {
            0x00u, 0x09u, 0x0Bu, 0x02u, 0x0Fu, 0x06u, 0x04u, 0x0Du,
            0x07u, 0x0Eu, 0x0Cu, 0x05u, 0x08u, 0x01u, 0x03u, 0x0Au
        };

        uint32 i;
        uint32 actualCrc = 0u;
        uint32 crcIndex;
    #endif /* #if (0u != CapSense_1_SELF_TEST_EN) */

    /* Extract parameter data */
    pData->offset     = CY_LO16(paramId);
    pData->affectsCrc = CY_LO8((paramId & PARAM_UBIT_MASK)  >> PARAM_UBIT_OFFSET);
    pData->widgetId   = CY_LO8((paramId & PARAM_WDID_MASK)  >> PARAM_WDID_OFFSET);
    pData->type       = CY_LO8((paramId & PARAM_TYPE_MASK)  >> PARAM_TYPE_OFFSET);
    pData->flash      = CY_LO8((paramId & PARAM_FBIT_MASK)  >> PARAM_FBIT_OFFSET);
    pData->rw         = CY_LO8((paramId & PARAM_RWBIT_MASK) >> PARAM_RWBIT_OFFSET);
    pData->crc        = CY_LO8((paramId & PARAM_CRC_MASK)   >> PARAM_CRC_OFFSET);

    /* Check parameter CRC if self-test is enabled */
    #if (0u != CapSense_1_SELF_TEST_EN)

        /* Calculate CRC for bits 0..24.
         * The CRC is calculated using nibbles (4-bits).
         * So for 0..24 bits there are in total 6 nibbles. */
        for (i = 6u; i > 0u; i--)
        {
            crcIndex = actualCrc ^ (paramId & 0x0Fu);
            actualCrc = crcTable[crcIndex];
            paramId >>= 4u;
        }

        /* Add bits 28..32 */
        crcIndex = actualCrc ^ ((paramId >> 4u) & 0x0Fu);
        actualCrc = crcTable[crcIndex];

        /* Add bits 24..28 (CRC) */
        crcIndex = actualCrc ^ (paramId & 0x0Fu);
        actualCrc = crcTable[crcIndex];

        if (0u != actualCrc)
        {
            /* CRC mismatch */
            result = CY_RET_BAD_PARAM;
        }

        if ((CY_RET_SUCCESS == result) &&
            (0u != pData->affectsCrc) && (pData->widgetId >= CapSense_1_TOTAL_WIDGETS ))
        {
            /* Wrong widgetId for protected parameter */
            result = CY_RET_BAD_PARAM;
        }

        /* Check offset value range */
        if (CY_RET_SUCCESS == result)
        {
            if (0u == pData->flash)
            {
                /* Check offset for RAM Data Structure range */
                if (pData->offset >= sizeof(CapSense_1_dsRam))
                {
                    result = CY_RET_BAD_PARAM;
                }
            }
            else
            {
                /* Check offset for Flash Data Structure range */
                if (pData->offset >= sizeof(CapSense_1_dsFlash))
                {
                    result = CY_RET_BAD_PARAM;
                }

                /* Check if it is marked as Read Only */
                if (0u != pData->rw)
                {
                    result = CY_RET_BAD_PARAM;
                }
            }
        }
    #else /* #if (0u != CapSense_1_SELF_TEST_EN) */
        /* Check offset value range */
        if (0u == pData->flash)
        {
            /* Check offset for RAM Data Structure range */
            if (pData->offset >= sizeof(CapSense_1_dsRam))
            {
                result = CY_RET_BAD_PARAM;
            }
        }
        else
        {
            /* Check offset for Flash Data Structure range */
            if (pData->offset >= sizeof(CapSense_1_dsFlash))
            {
                result = CY_RET_BAD_PARAM;
            }

            /* Check if it is marked as Read Only */
            if (0u != pData->rw)
            {
                result = CY_RET_BAD_PARAM;
            }
        }
    #endif /* #if (0u != CapSense_1_SELF_TEST_EN) */

    if (CY_RET_SUCCESS == result)
    {
        /* Check parameter type, offset alignment */
        switch (pData->type)
        {
        case DS_PARAM_TYPE_UINT16:
            if (0u != (pData->offset & UINT16_ALIGN_MASK))
            {
                result = CY_RET_BAD_PARAM;
            }
            break;

        case DS_PARAM_TYPE_UINT32:
            if (0u != (pData->offset & UINT32_ALIGN_MASK))
            {
                result = CY_RET_BAD_PARAM;
            }
            break;

