swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Structure.c
    /* verify if parameter is writable */
    if (CY_RET_SUCCESS == result)
    {
        if (0u == pData.rw)
        {
            result = CY_RET_BAD_PARAM;
        }
    }

    /* Parse and validate paramId */
    if (CY_RET_SUCCESS == result)
    {
        /* Get base address of parameter */
        ptrData.ptr = &CapSense_1_dsRam;

        /* Add offset to base address */
        ptrData.ptrUint8 += pData.offset;

        /* Write data */
        if (DS_PARAM_TYPE_UINT8 == pData.type)
        {
            *ptrData.ptrUint8 = CY_LO8(value);
        }
        else if (DS_PARAM_TYPE_UINT16 == pData.type)
        {
            *ptrData.ptrUint16 = CY_LO16(value);
        }
        else if (DS_PARAM_TYPE_UINT32 == pData.type)
        {
            *ptrData.ptrUint32 = value;
        }
        else
        {
            /* Parameter comes here already validated. */
            CY_ASSERT(0 != 0);
        }

        #if (CapSense_1_ENABLE == (CapSense_1_TST_WDGT_CRC_EN || CapSense_1_TST_GLOBAL_CRC_EN))
            /* Update widget or global CRC if self-test is enabled and parameter affects it */
            if (0u != pData.affectsCrc)
            {
                if ((ptrData.ptrUint16 >= &CapSense_1_dsRam.csd0Config) &&
                    (ptrData.ptrUint16 <  &CapSense_1_dsRam.glbCrc))
                {

                    #if (CapSense_1_ENABLE == CapSense_1_TST_GLOBAL_CRC_EN)
                        CapSense_1_DsUpdateGlobalCrc();
                    #endif /* (CapSense_1_ENABLE == CapSense_1_TST_GLOBAL_CRC_EN) */

                }
                else
                {
                    #if (CapSense_1_ENABLE == CapSense_1_TST_WDGT_CRC_EN)
                        CapSense_1_DsUpdateWidgetCrc((uint32)pData.widgetId);
                    #endif /* (CapSense_1_ENABLE == CapSense_1_TST_WDGT_CRC_EN) */
                }
            }
        #endif /* (CapSense_1_ENABLE == (CapSense_1_TST_WDGT_CRC_EN || CapSense_1_TST_GLOBAL_CRC_EN)) */
    }

    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_IsAnyWidgetActive
****************************************************************************//**
*
* \brief
*  Reports if any widget has detected a touch.
*
* \details
*  This function reports if any widget has detected a touch or not by extracting
*  information from the wdgtStatus registers
*  (CapSense_1_WDGT_STATUS<X>_VALUE). This function does not process a
*  widget but extracts processed results from the \ref group_structures.
*
* \return
*   Returns the touch detection status of all the widgets:
*     - Zero - No touch is detected in all the widgets or sensors.
*     - Non-zero - At least one widget or sensor detected a touch.
*
*******************************************************************************/
uint32 CapSense_1_IsAnyWidgetActive(void)
{
    uint32 result = 0Lu;
    uint32 wdWord;

    for (wdWord = CapSense_1_WDGT_STATUS_WORDS; wdWord-- > 0u;)
    {
        result |= CapSense_1_dsRam.wdgtStatus[wdWord];
    }

    return result;
}


/*******************************************************************************
* Function Name: CapSense_1_IsWidgetActive
****************************************************************************//**
*
* \brief
*  Reports if the specified widget detects a touch on any of its sensors.
*
* \details
*  This function reports if the specified widget has detected a touch or not by
*  extracting information from the wdgtStatus registers
*  (CapSense_1_WDGT_STATUS<X>_VALUE). This function does not process the
*  widget but extracts processed results from the \ref group_structures.
*
* \param widgetId
*  Specifies the ID number of the widget to get its status.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header
*  file defined as CapSense_1_<WidgetName>_WDGT_ID.
*
* \return
*  Returns the touch detection status of the specified widgets:
*    - Zero - No touch is detected in the specified widget or a wrong widgetId
*      is specified.
*    - Non-zero if at least one sensor of the specified widget is active, i.e.
*      a touch is detected.
*
*******************************************************************************/
uint32 CapSense_1_IsWidgetActive(uint32 widgetId)
{
    uint32 result = 0Lu;

    if (widgetId < CapSense_1_TOTAL_WIDGETS)
    {
        result = CapSense_1_GET_WIDGET_ACTIVE_STATUS(widgetId);
    }
    return result;
}


/*******************************************************************************
* Function Name: CapSense_1_IsSensorActive
****************************************************************************//**
*
* \brief
*  Reports if the specified sensor in the widget detects a touch.
*
* \details
*  This function reports if the specified sensor in the widget has detected a
*  touch or not by extracting information from the wdgtStatus registers
*  (CapSense_1_WDGT_STATUS<X>_VALUE). This function does not process the
*  widget or sensor but extracts processed results from the \ref group_structures.
*
*  For proximity sensors, this function returns the proximity detection status. To
*  get the finger touch status of proximity sensors, use the
*  CapSense_1_IsProximitySensorActive() function.
*
* \param widgetId
*  Specifies the ID number of the widget.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header
*  file defined as CapSense_1_<WidgetName>_WDGT_ID.

* \param sensorId
*  Specifies the ID number of the sensor within the widget to get its touch
*  detection status.
*  A macro for the sensor ID within the specified widget can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_SNS<SensorNumber>_ID.
*
* \return
*  Returns the touch detection status of the specified sensor / widget:
*    - Zero if no touch is detected in the specified sensor / widget or a wrong
*      widget ID / sensor ID is specified.
*    - Non-zero if the specified sensor is active i.e. touch is detected. If the
*      specific sensor belongs to a proximity widget, the proximity detection
*      status is returned.
*
*******************************************************************************/
uint32 CapSense_1_IsSensorActive(uint32 widgetId, uint32 sensorId)
{
    uint32 result = 0Lu;

    if ((widgetId < CapSense_1_TOTAL_WIDGETS) &&
        (sensorId < CapSense_1_GET_SENSOR_COUNT(widgetId)))
    {
        #if (CapSense_1_ENABLE == CapSense_1_PROXIMITY_WIDGET_EN)
            if (CapSense_1_WD_PROXIMITY_E ==
                (CapSense_1_WD_TYPE_ENUM)CapSense_1_dsFlash.wdgtArray[widgetId].wdgtType)
            {
                sensorId = CapSense_1_PROX_STS_OFFSET(sensorId);
            }
        #endif /* (CapSense_1_ENABLE != CapSense_1_PROXIMITY_WIDGET_EN) */
        result = CapSense_1_dsRam.snsStatus[widgetId] & (1Lu << sensorId);
    }

    return result;
}

